Revit 2027 API
BuiltInFailures.TilePatternTileFailures Class
 Failures related to tile pattern tile.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.TilePatternTileFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class TilePatternTileFailures
Public NotInheritable Class TilePatternTileFailures
public ref class TilePatternTileFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TilePatternTileFailures = class end
The BuiltInFailures.TilePatternTileFailures type exposes the following members.
Properties
Name | Description
TilePatternTile_InvalidFamily |  Family not appropriate for Divided Surface component.
Top
See Also
Reference
Autodesk.Revit.DB Namespace